#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/zleetch/terraform-vpc-ali-development/runs/run-GU8fVD8wkddEJrKF

Waiting for the plan to start...

Terraform v1.2.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.testing-vpc.alicloud_vpc.vpc will be created
  + resource "alicloud_vpc" "vpc" {
      + cidr_block        = "172.16.0.0/12"
      + id                = (known after apply)
      + ipv6_cidr_block   = (known after apply)
      + name              = (known after apply)
      + resource_group_id = (known after apply)
      + route_table_id    = (known after apply)
      + router_id         = (known after apply)
      + router_table_id   = (known after apply)
      + status            = (known after apply)
      + tags              = {
          + "Env"   = "development"
          + "Name"  = "vpc-testing-development"
          + "Runby" = "terraform"
          + "Team"  = "devops"
        }
      + vpc_name          = "vpc-testing-development"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
*Pusher: @zleetch, Action: `pull_request`*